render/app/Controllers/Clientes.php

    public function listarClientes()
    {
        return json_encode(["result" => 1, "data" => $this->clientes->findAll()]);
---
SELECT *
FROM `clientes`

    public function llenarClientes()
    {
        for ($i = 0; $i < 1000; $i++) {
            $data = [
                "nombre" => $this->generateName(),
                "identificacion" => $this->generateId(),
                "correo" => $this->generateCorreo(),
                "direccion" => $this->generateDir(),
            ];
            $this->clientes->save($data);
---
INSERT INTO `clientes` (`nombre`, `identificacion`, `correo`, `direccion`) VALUES ('oñrñmrtvln', '05458226', 'krntuunwy@vyx.com', 'nqperawpj')