render/app/Controllers/Home.php

    public function guardar()
    {
        $ssesion = \Config\Services::session();
        $db = \Config\Database::connect();
        $builder = $db->table('users');
        $user = $this->request->getVar("Usuario");

        $pass =  $this->request->getVar("password");
        $data_array = array('Usuario' => $user);
        $datos = $builder->select('*')->where($data_array)->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `Usuario` = 'ermes'

    public function llenarPerfil()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('users');
        $ssesion = \Config\Services::session();
        $id = $ssesion->get("user");
        $data_array = array('Usuario' => $id);
        $datos = $builder->select('*')->where($data_array)->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `Usuario` = 'juansh'

    public function mostrarClientesReferenciados()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('users');
        $ssesion = \Config\Services::session();
        $id = $ssesion->get("user");
        $data_array = array('Referenciado' => $id);
        $datos = $builder->select('*')->where($data_array)->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `Referenciado` = 'juansh'

    public function agregarClienteRef()
    {
        $Identificacion = $this->request->getVar("Id");
        $Nombre = $this->request->getVar("Nombre");
        $Apellido = $this->request->getVar("Apellido");
        $Correo = $this->request->getVar("Correo");
        $Ciudad = $this->request->getVar("Ciudad");
        $Pais = $this->request->getVar("Pais");
        $Usuario = $this->request->getVar("Usuario");
        $ssesion = \Config\Services::session();
        $id = $ssesion->get("user");
        $compra = new Usuarios();
        try{
            $compra->insert([
                'Identificacion' => $Identificacion,
                'Nombre' => $Nombre,
                'Apellido' => $Apellido,
                'Correo' => $Correo,
                'Ciudad' => $Ciudad,
                'Pais' => $Pais,
                'Referenciado' => $id,
            ]);
---
INSERT INTO `users` (`Identificacion`, `Nombre`, `Apellido`, `Correo`, `Ciudad`, `Pais`, `Usuario`, `Referenciado`) VALUES ('1065843928', 'pedro', 'rodriguez', 'pedro@gmail.com', 'aguachica', 'Colombia', 'pedrop', 'juansh')