render/app/Controllers/Productos.php

	public function __construct()
	{
		$this->mercadolibre = new Mercadolibre();
		$this->producto = new Producto();
		$this->usuario = new Usuarios();
		$respuesta = $this->producto->select("nombre, cantidad, codigo, precio, imagen, link, categoria")->findAll();
---
SELECT `nombre`, `cantidad`, `codigo`, `precio`, `imagen`, `link`, `categoria`
FROM `productos`

	public function getProduct()
	{
		$respuesta = $this->producto->select("nombre, cantidad, codigo, precio, imagen, link, categoria, estado")->findAll();
---
SELECT `nombre`, `cantidad`, `codigo`, `precio`, `imagen`, `link`, `categoria`
FROM `productos`
 LIMIT 2